---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CustomFieldService
source: html/867ee939-539d-080b-e8b6-288eb41860a0.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CustomFieldService Property

Autodesk Internal: The service for updating the custom fields of a schedule.

## Syntax (C#)
```csharp
public static ExternalServiceId CustomFieldService { get; }
```